---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.GetFamilyInstanceId
source: html/d62954b2-55dc-6f8c-8ceb-1528b90806a3.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.GetFamilyInstanceId Method

Gets the Id of the fiting or accessory instance

## Syntax (C#)
```csharp
public ElementId GetFamilyInstanceId()
```

## Returns
The element Id of the fiting or accessory instance.